# HW2
# Вывести на экран строку "Hello world"
# Вывести на экран пять звездочек (*)

# Задание со звездочкой:
# Вывести на экран квадрат 5 на 5 заполненный символами '#'
# В качестве решения нужно отправить ссылку на github репозиторий.


print("Hello world")
print(" ")
print("*****")
print(" ")
print("*****", "*****", "*****", "*****", "*****", sep='\n')
print(" ")
print("***** \n" * 5)
print(" ")
print(("*"*5 + "\n") * 5)
